In [1]:
import pandas as pd
import numpy as np

In [8]:
column_names = ['user_id', 'item_id', 'rating', 'timestamp']
dataset = pd.read_csv('u.data', names = column_names, sep='\t')

In [10]:
dataset.sample(5)

       user_id  item_id  rating  timestamp
52834      728      678       4  879442794
22668      465      477       4  883530742
42753      662      591       4  880570112
15730       92      963       5  875652981
53418      752      340       4  891208077

In [ ]:
# Let's get the title dataset

In [12]:
movie_titles = pd.read_csv('Movie_Id_Titles')
movie_titles.sample(5)

      item_id                                   title
421       422  Aladdin and the King of Thieves (1996)
1592     1593               Death in Brunswick (1991)
1376     1377                    Hotel de Love (1996)
704       705              Singin' in the Rain (1952)
198       199    Bridge on the River Kwai, The (1957)

In [ ]:
# let's merge the datasets

In [14]:
df = pd.merge(dataset, movie_titles, on='item_id')
df.sample(5)

       user_id  item_id  rating  timestamp                         title
8563       643      100       5  891445140                  Fargo (1996)
19057      529      307       5  882534996  Devil's Advocate, The (1997)
11069      408      288       4  889679791                 Scream (1996)
2836       889      257       4  880176845           Men in Black (1997)
56818      409       22       2  881108077             Braveheart (1995)

In [ ]:
# EDA

In [ ]:
import matplotlib.pyplot as plt
import seaborn as sn
sn.set_style('white')
%matplotlib inline